// 参照：Let'sプログラミング
// フィールドとは

// 1 フィールドとは
// ・フィールドはクラスの中でデータの値を保管するために使用するもの
// （例：フィールドを定義する場合）
// class クラス名{
//   データ型 フィールド名;
// }
// ・最初にフィールドに格納するデータのデータ型を記述したあとフィールド名を指定する

// 参照：エンジニアの入り口
// 【初心者向け】Javaのメソッドとフィールドの基本まとめ

1 Javaのメソッドとフィールドとは？
・クラスとはプログラムの設計図のようなもの
・その設計図がどのような処理やデータを扱っているのかということを、メソッドとフィールドで書いてゆく必要がある。
・メソッドとはクラスが持っている機能のことで、実際にプログラムが実行されるときに実行される内容が書かれている。
・フィールドとはクラスが持っている情報のことで、そのクラスがどのような情報を扱うのかが書かれている。プロパティとも呼ばれることも多い。
（例：スマホ）
スマートフォンを想像してみよう。スマートフォン本体をクラスだとすると、電話を掛ける、通信する、アプリを実行するという機能的なものはメソッドだと言える。そして端末名、電話番号、色、サイズなどのスマートフォンが持つ情報はフィールドだと言える
