/* 参照：Piazaラーニング
Java入門編1：プログラミングを学ぶ

1 chapter01_Javaとは？

2 chapter02_Javaでプログラムを書いてみよう

public class Java_2 {
	public static void main(String[] args) {
		System.out.println("グッドモーニング")
	}
}

2_1 間違いやすいポイント
・末尾のセミコロン忘れ。
・カッコやダブルクォーテーションが全角文字になっている。
・メソッドが、全て半角小文字で記述されていない。（× Println、○ println）
・ただし、System.outの先頭は、大文字にする。

2_2 メソッドとは
Javaでは、この「println」のような命令を「メソッド」と呼んでいます。
プログラミングでは、「println」のようなメソッドで、コンピュータに対して動作を指示していきます。「println」と書くと、文字を表示するのだなとJavaが理解して、そのとおり動いてくれるのです。
プログラミング言語は、このようなメソッドをたくさん持っています。各メソッドがどのように動作をするか、プログラミング言語ごとに決まっています。*/